In [1]:
# Import all libraries needed 

import pandas as pd
import numpy as np

import matplotlib.pyplot as plt
import sys

# Enable inline plotting

%matplotlib inline

In [2]:
# Loading data from csv file

Location = "axisdata.csv"
df = pd.read_csv(Location)

In [6]:
# Display first five lines of data

df.head()

,Fname,Lname,Gender,Hours Worked,SalesTraining,Years Experience,Cars Sold
0,Jada,Walters,F,39,N,3,2
1,Nicole,Henderson,F,46,N,3,6
2,Tanya,Moore,F,42,Y,4,6
3,Ronelle,Jackson,F,38,Y,5,3
4,Brad,Sears,M,33,N,4,2

In [3]:
# Checking for missing data

missing_data_counts = pd.DataFrame(df.isnull().sum(), columns=['Missing Values'])
missing_data_counts

                  Missing Values
Fname                          0
Lname                          0
Gender                         0
Hours Worked                   0
SalesTraining                  0
Years Experience               0
Cars Sold                      0

In [10]:
# Checking for duplicated data

df.duplicated()

0      False
1      False
2      False
3      False
4      False
5      False
6      False
7      False
8      False
9      False
10     False
11     False
12     False
13     False
14     False
15     False
16     False
17     False
18     False
19     False
20     False
21     False
22     False
23     False
24     False
25     False
26     False
27     False
28     False
29     False
       ...
969    False
970    False
971    False
972    False
973    False
974    False
975    False
976    False
977    False
978    False
979    False
980    False
981    False
982    False
983    False
984    False
985    False
986    False
987    False
988    False
989    False
990    False
991    False
992    False
993    False
994    False
995    False
996    False
997    False
998    False
Length: 999, dtype: bool

In [22]:
# Display last five lines of data

df.tail()

,Fname,Lname,Gender,Hours Worked,SalesTraining,Years Experience,Cars Sold
994,Victor,Kane,M,22,Y,5,4
995,Charles,Turner,M,45,N,1,4
996,August,Franklin,F,34,Y,4,3
997,Victoria,Rogers,F,29,N,5,1
998,Mike,Gerardo,M,20,N,3,3

In [28]:
# Computing the average years of experience 

print ("Average Years of Experience")
df['Years Experience'].mean()

Average Years of Experience

3.026026026026026

In [17]:
# Creating new dataframe where cars sold are greater than 3

df2 = df.loc[df['Cars Sold'] >3]
df2.head()

,Fname,Lname,Gender,Hours Worked,SalesTraining,Years Experience,Cars Sold
1,Nicole,Henderson,F,46,N,3,6
2,Tanya,Moore,F,42,Y,4,6
7,Carla,Sapp,F,39,Y,3,6
8,Karen,Moore,F,33,Y,2,5
9,Roger,Kane,M,38,N,4,5

In [29]:
# Average years of experience of new dataframe

print ("Average Years of Experience for people selling > 3 cars per month ")
df2['Years Experience'].mean()

Average Years of Experience for people selling > 3 cars per month

3.0492359932088284

In [31]:
# Average cars sold by all in orginial dataframe

print ("Average Cars Sold per Month")
df['Cars Sold'].mean()

Average Cars Sold per Month

3.9229229229229228

In [33]:
# Average hours worked in new data frame

print ("Average hours worked by people selling > 3 cars per month")
df2['Hours Worked'].mean()

Average hours worked by people selling > 3 cars per month

34.740237691001695

In [35]:
# Display in pivot table average of cars sold by gender of all

print ("Average of Cars sold per month by gender")
pd.pivot_table(df, values=['Cars Sold'], index =['Gender'])

Average of Cars sold per month by gender

        Cars Sold
Gender
F        3.760736
M        4.078431

In [37]:
# Maximum value of cars sold column

print ("Max Cars Sold per month")
df['Cars Sold'].max()

Max Cars Sold per month

7

In [38]:
# Minimum value of cars sold column

print ("Min Cars Sold per month")
df['Cars Sold'].min()

Min Cars Sold per month

1